HarryVienna/ESP32-Weather-Station-and-Air-Quality-Monitor/Sensor-ESP-NOW-BME280/sdkconfig.defaults
# Target chip
CONFIG_IDF_TARGET="esp32"

# No reboot after panic
CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT=y

# FreeRTOS
#CONFIG_FREERTOS_HZ=100

# ESP32-specific
CONFIG_ESP32_TIME_SYSCALL_USE_RTC_FRC1=y
CONFIG_ESP32_RTC_CLK_SRC_INT_RC=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240

CONFIG_LOG_DEFAULT_LEVEL_DEBUG=n
CONFIG_LOG_DEFAULT_LEVEL=3

CONFIG_ESP_TASK_WDT=n

CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=n
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# Disable old I2C driver to avoid conflict with new I2C driver
CONFIG_IDF_DRIVER_I2C_MASTER_NG=y
CONFIG_IDF_DRIVER_I2C_MASTER_OLD=n


